In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("Lawsuit.csv")
df

      ID  Dept  Gender  Clin  Cert  Prate  Exper  Rank   Sal94   Sal95
0      1     1       1     0     0    7.4      9     3   77836   84612
1      2     1       1     0     0    6.7     10     2   69994   78497
2      3     1       1     0     0    8.1      6     1   62872   67756
3      4     1       1     1     1    5.1     27     3  155196  173220
4      5     1       1     0     0    7.0     10     3   89268   96099
..   ...   ...     ...   ...   ...    ...    ...   ...     ...     ...
256  257     6       0     1     1    2.9      8     2  297174  323699
257  258     6       0     1     1    2.6      9     3  308081  339664
258  259     6       0     1     1    2.8      8     1  211269  241577
259  260     6       0     1     1    2.4      2     1  210801  233905
260  261     6       0     1     1    3.2      5     1  244551  265502

[261 rows x 10 columns]

In [3]:
df.head()

   ID  Dept  Gender  Clin  Cert  Prate  Exper  Rank   Sal94   Sal95
0   1     1       1     0     0    7.4      9     3   77836   84612
1   2     1       1     0     0    6.7     10     2   69994   78497
2   3     1       1     0     0    8.1      6     1   62872   67756
3   4     1       1     1     1    5.1     27     3  155196  173220
4   5     1       1     0     0    7.0     10     3   89268   96099

In [4]:
df.tail()

      ID  Dept  Gender  Clin  Cert  Prate  Exper  Rank   Sal94   Sal95
256  257     6       0     1     1    2.9      8     2  297174  323699
257  258     6       0     1     1    2.6      9     3  308081  339664
258  259     6       0     1     1    2.8      8     1  211269  241577
259  260     6       0     1     1    2.4      2     1  210801  233905
260  261     6       0     1     1    3.2      5     1  244551  265502

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 261 entries, 0 to 260
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      261 non-null    int64
 1   Dept    261 non-null    int64
 2   Gender  261 non-null    int64
 3   Clin    261 non-null    int64
 4   Cert    261 non-null    int64
 5   Prate   261 non-null    float64
 6   Exper   261 non-null    int64
 7   Rank    261 non-null    int64
 8   Sal94   261 non-null    int64
 9   Sal95   261 non-null    int64
dtypes: float64(1), int64(9)
memory usage: 20.5 KB

In [6]:
df.isnull().any()

ID        False
Dept      False
Gender    False
Clin      False
Cert      False
Prate     False
Exper     False
Rank      False
Sal94     False
Sal95     False
dtype: bool